<a href="https://colab.research.google.com/github/mtu5017/IST210/blob/master/Animal_Adoption_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import sqlite3 # Once imported in a single notebook, it is available to us throughout the rest of the notebook. 
# connect to database, if not there, create it.
connectionToDatabase = sqlite3.connect('AdoptionCenterData') 
cursor = connectionToDatabase.cursor()
cursor.execute('''drop table IF EXISTS animal''')
connectionToDatabase.commit()

cursor.execute('''create table animal (animalID int PRIMARY KEY, breed text, gender text, storeID int, monthAdopted text)''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into animal values (10001, "Dog", "Male", 1, "January");''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into animal values (18955, "Lynx", "Male", 1, "May");''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into animal values (29503, "Caracal", "Female", 1, "September");''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into animal values (14093, "Dog", "Female", 3, "March");''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into animal values (18745, "Chicken", "male", 2, "January");''')
connectionToDatabase.commit()

In [131]:
cursor.execute('select * FROM animal')

for row in cursor.fetchall():
  print (row)

(10001, 'Dog', 'Male', 1, 'January')
(18955, 'Lynx', 'Male', 1, 'May')
(29503, 'Caracal', 'Female', 1, 'September')
(14093, 'Dog', 'Female', 3, 'March')
(18745, 'Chicken', 'male', 2, 'January')

In [0]:
cursor.execute('''drop table IF EXISTS employees''')
connectionToDatabase.commit()

cursor.execute('''create table employees (employeeID int PRIMARY KEY, firstName text, lastName text, jobTitle text, salary int, storeID int)''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into employees values (52, "Mark", "Roberts", "Cashier", 10000, 1);''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into employees values (20, "Bill", "Waters", "Manager", 70000, 1);''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into employees values (903, "Humuhumunukunukuapua'a", "Smith", "Cashier", 30000, 3);''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into employees values (404, "Karen", "Williams", "Regional-Manager", 40000, 5);''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into employees values (808, "Samuel", "Baldwin", "Cashier", 25495, 4);''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into employees values (439, "Annie", "Waller", "Cashier", 32000, 2);''')
connectionToDatabase.commit()

In [139]:
cursor.execute('select * FROM employees')

for row in cursor.fetchall():
  print (row)

(52, 'Mark', 'Roberts', 'Cashier', 10000, 1)
(20, 'Bill', 'Waters', 'Manager', 70000, 1)
(903, "Humuhumunukunukuapua'a", 'Smith', 'Cashier', 30000, 3)
(404, 'Karen', 'Williams', 'Regional-Manager', 40000, 5)
(808, 'Samuel', 'Baldwin', 'Cashier', 25495, 4)
(439, 'Annie', 'Waller', 'Cashier', 32000, 2)

In [0]:
cursor.execute('''drop table IF EXISTS storeID''')
connectionToDatabase.commit()

cursor.execute('''create table storeID (storeID int PRIMARY KEY, location text, hourOpen int, hourClose int, supervisorID int)''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into storeID values (1, "Pittsburg", 9, 6, 20);''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into storeID values (3, "Philadelphia", 8,6, 608);''')
connectionToDatabase.commit()

In [0]:
 
cursor.execute('''insert into storeID values (4, "Havana", 12, 12, 608);''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into storeID values (6, "Johannesburg", 9, 6, 608);''')
connectionToDatabase.commit()

In [0]:
 
cursor.execute('''insert into storeID values (8, "Irkutsk", 10, 8, 608);''')
connectionToDatabase.commit()

In [146]:
cursor.execute('select * FROM storeID')

for row in cursor.fetchall():
  print (row)

(1, 'Pittsburg', 9, 6, 20)
(3, 'Philadelphia', 8, 6, 608)
(4, 'Havana', 12, 12, 608)
(6, 'Johannesburg', 9, 6, 608)
(8, 'Irkutsk', 10, 8, 608)

In [0]:
cursor.execute('''drop table IF EXISTS customerID''')
connectionToDatabase.commit()

cursor.execute('''create table customerID (customerID int PRIMARY KEY, userName text, password text, firstName text, lastName text, age int)''')
connectionToDatabase.commit()

In [0]:
 
cursor.execute('''insert into customerID values (777, "will89", "grandkids09", "George", "Morrison", 89);''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into customerID values (718, "bill19", "ethicsormorality", "Bill", "Backland", 23);''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into customerID values (2045, "Jean40", "mongolianthroatsinging", "Jean", "Blanc", 3);''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''insert into customerID values (91928, "Taylor78", "PASSWORD", "Taylor", "Jones", 40);''')
connectionToDatabase.commit()

In [0]:
 
cursor.execute('''insert into customerID values (1578, "jimmys289", "fido300", "Jim", "John", 59);''')
connectionToDatabase.commit()

In [153]:
cursor.execute('select * FROM customerID')

for row in cursor.fetchall():
  print (row)

(777, 'will89', 'grandkids09', 'George', 'Morrison', 89)
(718, 'bill19', 'ethicsormorality', 'Bill', 'Backland', 23)
(2045, 'Jean40', 'mongolianthroatsinging', 'Jean', 'Blanc', 3)
(91928, 'Taylor78', 'PASSWORD', 'Taylor', 'Jones', 40)
(1578, 'jimmys289', 'fido300', 'Jim', 'John', 59)

Which month do people adopt animals in the most?

In [168]:
cursor.execute('''select monthAdopted, COUNT(monthAdopted) from animal group by monthAdopted order by count(monthAdopted) desc limit 5''')
for row in cursor.fetchall():
  print (row)

('January', 2)
('March', 1)
('May', 1)
('September', 1)

People adopt the most during the month of January.  We came to the conclusion because during this time it is the coldest part of the year. This data allowed us to see when the best months of business throughout the year.  We would be able to use this data in order to know to hold more animals in the shelter during this time. We also chose this question to show the data on the peak adoption times throughout the year.

Which animal is adopted the most?

In [167]:
cursor.execute('''select breed, COUNT(breed) from animal group by breed order by count(breed) desc limit 5''')
for row in cursor.fetchall():
  print (row)

('Dog', 2)
('Caracal', 1)
('Chicken', 1)
('Lynx', 1)

The most adopted animal type is dogs. This question was used to display the rate of adoption for animals, which can be compared to find trends. The purpose is to use these trends as information, then translated to knowledge. This allows the business to understand which animals are the most important to have available to adopters at any given time.

Which employees have the highest salaries?

In [171]:
cursor.execute('''select jobTitle, salary from employees order by salary desc limit 5''')
for row in cursor.fetchall():
  print (row)

('Manager', 70000)
('Regional-Manager', 40000)
('Cashier', 32000)
('Cashier', 30000)
('Cashier', 25495)

The employees with the highest salaries are managers. Our one manager in our dataset makes 70,000 dollars, then our one regional manager makes the second most with 40,000 dollars. The question allows the business to manage expenses as well as gain a baseline for the average cost of personnel. Management can compare people with similar jobs to make sure everyone receives a fair salary for their position. Lastly, the adoption center can compare the salaries of employees with other similar adoption centers.